app/controllers/heros_controller.rb

  def create
    @hero = Hero.new(params[:hero])
    if @hero.save
---
INSERT INTO "heros" ("clan_id", "hero_aggr", "hero_align", "hero_artlim", "hero_attack", "hero_char", "hero_create", "hero_def", "hero_dmg", "hero_en", "hero_exp", "hero_hp", "hero_int", "hero_level", "hero_location_id", "hero_max_hp", "hero_name", "hero_range", "hero_reg", "hero_str", "hero_x", "hero_y") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "hero_id"