app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_login" = 'lg' LIMIT 1
---
  def create
    user = User.find_by_user_login(params[:user_login])