app/controllers/users_controller.rb

INSERT INTO "users" ("hero_id", "password_digest", "user_login") VALUES ($1, $2, $3) RETURNING "user_id"  [["hero_id", nil], ["password_digest", "$2a$10$IoxCsoC3I72vjwmdp9m86O8X253y1gfW3rQrjzJecGNoY4RdjVmAe"], ["user_login", "et,fy"]]
---
  def create
    @user = User.new(params[:user])
    #@user.hero_id= 0
    if @user.save